/*
 Добавление новых записей в таблицу users
*/

INSERT INTO users (email, name, password)
VALUES ("vasilisa@yandex.ru", "Василиса", "rnjnfv"),
        ("nikifor@gmail.com", "Никифор", "zpltcm");

/*
 Добавление новых записей в таблицу projects
*/

INSERT INTO projects (user_id, name)
VALUES (1, "Входящие"),
       (1, "Учёба"),
       (1, "Работа"),
       (1, "Домашние дела"),
       (1, "Авто"),
       (1, "Ремонт"),
       (2, "Главное"),
       (2, "Проект"),
       (2, "Учёба"),
       (2, "Игра"),
       (2, "Туризм");


/*
 Добавление новых записей в таблицу tasks
*/

INSERT INTO tasks (user_id, project_id, title, deadline)
VALUES (1, 3, "Собеседование в IT компании", "2019-12-11"),
       (1, 3, "Выполнить тестовое задание", "2019-12-09"),
       (1, 2, "Сделать задание первого раздела", "2019-12-04"),
       (1, 2, "Сделать задание второго раздела", "2019-12-07"),
       (1, 1, "Встреча с другом", "2019-12-06"),
       (1, 1, "Сходить в кино с друзьями", "2019-12-08"),
       (1, 4, "Купить корм для кота", "2019-12-09"),
       (1, 4, "Заказать пиццу", "2019-12-10"),
       (1, 5, "Сменить резину", "2019-12-01"),
       (1, 5, "Купить машину", "2020-01-14"),
       (2, 8, "Сдать проект", "2019-12-09"),
       (2, 8, "Выполнить тестовое задание", "2019-12-11"),
       (2, 9, "Купить книгу по MySQL", "2019-12-06"),
       (2, 7, "Снять квартиру", "2019-12-07"),
       (2, 10, "Футбол", "2019-12-08"),
       (2, 10, "Заказать пиццу", "2019-12-08"),
       (2, 10, "Встретиться с друзьями", "2019-12-10"),
       (2, 7, "Купить новый ноутбук", "2019-12-10"),
       (2, 7, "Купить корм для собаки", "2019-12-06");